{
	"@metadata": {
		"authors": [
			"Amire80",
			"Liuxinyu970226",
			"Macofe",
			"Nemo bis",
			"Robby",
			"Siebrand",
			"Yurik"
		]
	},
	"gather": "Title of special page shown on Special:SpecialPages for viewing your own lists.",
	"gathereditfeed": "Title of special page shown on Special:SpecialPages that shows a feed of edits for Gather collections.",
	"gatherlists": "Title of special page shown on Special:SpecialPages that allows you to view all publicly created lists.",
	"gather-checkuser-log-action": "Message that shows up in Special:CheckUser when an action on a collection is made.\nParameters:\n* $1 - action performed on collection.\n* $2 - a link to the collection being operated on.",
	"gather-purpose-login-action": "Shows on [[Special:UserLogin]] prompting user to login.",
	"gather-purpose-signup-action": "Shows on [[Special:UserLogin]] prompting user to sign up.",
	"beta-feature-gather": "Title for the Gather beta feature.",
	"beta-feature-gather-description": "Description for Gather beta feature.",
	"gather-lists-showhidden": "Link title to show hidden lists on [[Special:GatherLists]].",
	"gather-lists-showvisible": "Link title to show visible lists on [[Special:GatherLists]].",
	"gather-lists-collection-owner": "Table column header in a list of all collections. The column will list usernames of people who own collection.\n{{Identical|Owner}}",
	"gather-lists-collection-last-updated": "Label for last updated time of a collection\n{{Identical|Last updated}}",
	"gather-lists-collection-title": "Label for title of collection on list of all collections\n{{Identical|Title}}",
	"gather-lists-collection-description": "Label for description of collection on list of all collections\n{{Identical|Description}}",
	"gather-lists-collection-count": "Label for count of collection on list of all collections\n{{Identical|Count}}",
	"gather-lists-hide-collection-label": "Label for button that performs moderation hide action which sets list from public to hidden.\n{{Identical|Hide}}",
	"gather-lists-hide-collection": "Label asking for confirmation when hiding a user's collection for moderation purposes. Parameters:\n* $1 - Title of the collection.\n* $2 - User name of the owner.",
	"gather-lists-hide-success-toast": "Label for toast displaying that specified list was hidden successfully. Parameters:\n* $1 - Title of the collection.",
	"gather-lists-hide-failure-toast": "Label for toast diaplaying that hiding specified list failed. Parameters:\n* $1 - Title of the collection.",
	"gather-lists-show-collection-label": "Label for button that performs moderation reveal/show action which resets list from hidden to public.\n{{Identical|Reveal}}",
	"gather-lists-show-collection": "Label asking for confirmation when revealing a user's collection for moderation purposes. Parameters:\n* $1 - Title of the collection.\n* $2 - User name of the owner.",
	"gather-lists-show-success-toast": "Label for toast displaying that specified list was shown successfully. Only shown to admins. Parameters:\n* $1 - Title of the collection.",
	"gather-lists-show-failure-toast": "Label for toast diaplaying that showing specified list failed. Only shown to admins. Parameters:\n* $1 - Title of the collection.",
	"gather-lists-hide-protocol": "Text shown to administrator to a moderation policy which outlines moderation expectations on [[Special:GatherLists]] (optional)",
	"gather-my-collections": "Label for tab pointing to the current user's collections.",
	"gather-all-collections": "Label for tab pointing to all public collections.\n{{Identical|Recent}}",
	"gather-collection-random-title": "Title of a collection which contains random items.",
	"gather-collection-random-description": "Description of a collection which contains random items.",
	"gather-collection-edited-title": "Title of collection which contains recently edited items.",
	"gather-collection-edited-description": "Description of a collection which contains the most recently edited pages from across {{SITENAME}}",
	"gather-editfeed-show": "Label for a button to switch to a list of pages from the list of updates to said pages.\n\n{{Identical|Show}}",
	"gather-editfeed-title": "Title for page that allows you to view edits inside a collection.",
	"gather-editfeed-empty": "Message that shows when no edits have been made recently to any pages inside a collection.",
	"gather-remove-from-collection-failed-toast": "Error message displayed to user when remove from collection action fails.",
	"gather-add-to-collection-failed-toast": "Error message displayed to user when add to collection action fails",
	"gather-edit-collection-heading": "Heading for collection editor overlay",
	"gather-edit-collection-label-name": "Label above input field for name of collection\n{{Identical|Name}}",
	"gather-edit-collection-label-private": "Label ajacent to privacy icon indicating collection is private when ticked",
	"gather-edit-collection-label-description": "Label above input field for description of collection\n{{Identical|Description}}",
	"gather-edit-collection-save-label": "Label for save button in collection editor.\n{{Identical|Save}}",
	"gather-edit-collection-title-label": "Label for the title of the collection editor.",
	"gather-edit-collection-settings-title-label": "Label for the header of the collection editor while editing collection settings.",
	"gather-edit-collection-failed-error": "There was a problem saving the changes.",
	"gather-edit-collection-clear-label": "Label for button that clears search.\n{{Identical|Clear}}",
	"gather-edit-collection-related-pages": "Label for header of a section with related pages suggested for a collection.",
	"gather-edit-collection-title-empty": "Placeholder for collection name input field indicating that a collection name is required.",
	"gather-edit-collection-description-empty": "Placeholder for description input field which indicates that descriptions are optional.",
	"gather-delete-collection-confirm": "Text under the heading asking the user if they would like to delete a collection.",
	"gather-delete-collection-heading": "Heading for collection delete confirmation overlay",
	"gather-delete-collection-delete-label": "Label for delete button in delete confirmation overlay.\n{{Identical|Delete}}",
	"gather-delete-collection-success": "Toast message indicating that deletion was successful.",
	"gather-delete-collection-failed-error": "Toast error indicating there was a problem deleting the collection.",
	"gather-flag-collection-heading": "Heading text for collection flag confirmation overlay",
	"gather-flag-collection-confirm": "Text under the heading asking the user if they would like to flag a collection for review.",
	"gather-flag-collection-flag-label": "Label for flag button in flag collection confirmation overlay.\n{{Identical|Flag}}",
	"gather-flag-collection-success": "Toast message indicating that flagging the collection was successful.",
	"gather-confirmation-cancel-button-label": "Label for cancel button in confirmation overlay.\n{{Identical|Cancel}}",
	"gather-error-unknown-collection": "Error message test when you try to edit a collection you do not own or that does not exist.",
	"gather-collection-member": "Alternative text displayed next to collection name when page is a member.",
	"gather-collection-non-member": "Alternative text displayed next to collection name when page is not a member.",
	"gather-collection-owner-text": "Informative message about who wrote the collection.\nParameters\n* $1 - the user that created the collection. Note this parameter is passed as a link with an icon.\n* $2 is the plain text username of the user that created the collection, used for GENDER.",
	"gather-anon-cta": "Message that shows to anonymous users when they click the add to collection button.",
	"gather-tutorial-dismiss-button-label": "General label used for dismissing a tutorial overlay.",
	"gather-create-new-button-label": "Label for a button that is used to create a new collection.\n{{Identical|Create}}",
	"gather-create-collection-button-label": "Label for a button that is used to create a new collection on Special:Gather",
	"gather-add-new-placeholder": "Placeholder text for input field for new collection.",
	"gather-add-to-new": "Heading that shows in the watchstar content overlay above a form to create a new public collection.",
	"gather-add-to-existing": "Heading that shows in the watchstar content overlay above a list of your existing collections.",
	"gather-add-toast": "Message displayed when you add an item to a collection. Parameters:\n* $1 - Name of collection.",
	"gather-new-collection-failed-toast": "Message displayed when creating a new collection fails. Parameters:\n* $1 - Name of collection.",
	"gather-add-failed-toast": "Message displayed when adding an item to a collection fails. Parameters:\n* $1 - Name of collection.",
	"gather-add-title-invalid-toast": "Message displayed to a user when editing or creating a collection fails because of an invalid title.",
	"gather-collection-content-tutorial-heading": "Heading text for collection creation explaining to a user how to start a collection.  Tutorial is shown to users with zero collections.",
	"gather-collection-content-tutorial-subheading": "Text explaining to a user that they have the option of adding this page to their watchlist instead of creating a collection.",
	"gather-add-to-collection-summary": "Text for a tutorial overlay presented to a user the first time they see the collections watchstar asking them if they would like to add the current page to a collection.\n\nParameters:\n* $1 - page title\n* $2 - currently logged in username for use in gender",
	"gather-add-to-collection-confirm": "Label for button that user can click if they would like to add the current page to a collection",
	"gather-add-to-collection-cancel": "Label for button that user can click if they do not want to add to a collection.\n{{Identical|No thanks}}",
	"gather-update-collection-success": "Message that shows when collection description and/or title changed.",
	"gather-edit-collection-confirm": "Confirm message prompting you to save changes before exiting.",
	"gather-remove-toast": "Message displayed when you remove an item from a collection. Parameters:\n* $1 - Name of collection.",
	"gather-no-such-action": "Message used, if thse user tried to request a non-existent action on a collection.",
	"gather-unknown-error": "Used as an error message, if there was an unknown error.",
	"gather-desc": "{{desc|name=Gather|url=https://www.mediawiki.org/wiki/Extension:Gather}}",
	"gather-no-public-lists-title": "The title of the view shown when there are no public collections for a user.",
	"gather-no-public-lists-description": "The descriptive text explaining that there are no public collections for a user.\nParameters:\n* $1 - username of current user for use in gender.",
	"gather-page-not-found": "Text in place of the collection excerpt explaining that the page does not exist",
	"gather-anon-view-lists": "Text shown when trying to see your own collections on [[Special:Gather]] but the user is not logged in.",
	"gather-watchlist-title": "Title used for special casing the Watchlist collection on the [[Special:Gather]] page.\n{{Identical|Watchlist}}",
	"gather-watchlist-description": "Default description for special casing the Watchlist collection on the [[Special:Gather]] page.",
	"gather-lists-title": "Title for [[Special:Gather]] when displaying user curated lists.\n{{Identical|Collection}}",
	"gather-meta-description": "Description of the [[Special:Gather]] page of collections of a user. Added to the meta tag on the html.\nParameters: $1 - name of user who collections belong to.",
	"gather-read-more": "Label for the read more link used on [[Special:Gather]].\n{{Identical|Read more}}",
	"gather-private": "Label for a collection when it is not publicly visible\n{{Identical|Private}}",
	"gather-public": "Label for a collection when it is publicly visible\n{{Identical|Public}}",
	"gather-hidden": "Label for a collection when it has been hidden from the public by an administrator\n{{Identical|Hidden}}",
	"gather-moderation-hidden": "Label for echo notification explaining that your collection was hidden.  Also providing links to moderation criteria and methods to contest your collection moderation. Parameters:\n* $1 - Url of collection.",
	"gather-moderation-hidden-email-subject": "Label for echo notification email subject explaining that your collection was hidden.Parameters:\n* $1 - Url of collection.",
	"gather-moderation-hidden-email-body": "Label for echo notification email body explaining that your collection was hidden.  Also providing links to moderation criteria and methods to contest your collection moderation. Parameters:\n* $1 - Url of collection.",
	"gather-moderation-unhidden": "Label for echo notification explaining that your collection was unhidden and that it can be viewed again as normal. Parameters:\n* $1 - Url of collection.",
	"gather-moderation-unhidden-email-subject": "Label for echo notification email subject explaining that your collection was unhidden. Parameters:\n* $1 - Url of collection.",
	"gather-moderation-unhidden-email-body": "Label for echo notification email body explaining that your collection was unhidden. Parameters:\n* $1 - Url of collection.",
	"echo-category-title-gather": "A label for the Gather checkboxes in the Echo notifications preferences.",
	"gather-echo-pref-tooltip": "This is a short description of the gather notification category in the Echo notifications preferences.\n{{Related|Echo-pref-tooltip}}",
	"gather-article-count": "Expression of the number of pages in a collection. Parameter:\n* $1 - number of pages in the collection\n{{Identical|Page}}",
	"gather-empty": "Message shown on an empty rendered collection on [[Special:Gather]].",
	"gather-empty-footer-mine": "Footnote shown on an empty collection on [[Special:Gather]] when the collection belongs to them.\nParameters:\n* $1 - username of current user for use in gender.",
	"gather-empty-footer": "Footnote shown on an empty collection on [[Special:Gather]] for a collection that doesn't belong to them.",
	"gather-edit-button": "Label for a button that enables editing a collection.\n{{Identical|Edit}}",
	"gather-delete-button": "Label for a button that enables deleting a collection.\n{{Identical|Delete}}",
	"gather-overlay-edit-button": "Label for button that enables editing of description and name of a collection.",
	"gather-overlay-continue": "Label for button inside overlay to take you to another screen.\n{{Identical|Next}}",
	"gather-overlay-search-empty": "Message shown on a search input when empty, for searching and adding/removing items from a collection",
	"gather-overlay-search-new": "Link label to start a new search (focus search input) when no results are found.",
	"gather-overlay-search-results-empty": "Message shown on search results page when no pages are found.\nParameters:\n* $1 - search query.",
	"gather-overlay-search-tutorial-heading": "Heading for tutorial pointing at search icon with instructions on how to add a second page page to their collection.",
	"gather-overlay-search-tutorial-text": "Text explaining to a user that they may also add suggested search pages to a collection.",
	"right-gather-hidelist": "With gather, users can create lists and make them public. This right gives admins a way to hide or restore a list that violates WP policy.\n\n{{Doc-right|gather-hidelist}}",
	"apihelp-gather-description": "{{doc-apihelp-description|gather}}\nA Gather collection is a list of pages that can be shared with readers and editors.",
	"apihelp-gather-param-gather": "{{doc-apihelp-param|gather|gather}}",
	"apihelp-gather-param-owner": "{{doc-apihelp-param|gather|owner}}",
	"apihelp-gather-example-1": "{{doc-apihelp-example|gather}}",
	"gather-lists-collection-more-link-label": "Link label for a more type link on the Special:GatherLists page.",
	"gather-lists-more-no-owner": "Link label for more link at the bottom of a list of recent and other collections that don't have an owner.",
	"gather-lists-more": "Link label for more link at the bottom of a list of users existing collections.",
	"gather-lists-more-failed": "Message shown when loading more collections in a list fails.",
	"gather-collection-more": "Label for link at bottom of Gather collection when there are more than 50 items.",
	"gather-add-to-another": "Label for button at bottom of collection overlay for when you have more collections that you could potentially add to.",
	"gather-watchstar-button-label": "A label for the button to add to a collection.",
	"gather-menu-guider": "Message that shows up in an overlay pointing at the menu button.",
	"gather-api-help-param-listid": "{{doc-apihelp-param|lsm|id|listmembership|query+listmembership}}",
	"gather-api-help-param-listowner": "{{doc-apihelp-param|lsm|owner|listmembership|query+listmembership}}",
	"gather-api-help-param-listtoken": "{{doc-apihelp-param|lsm|token|listmembership|query+listmembership}}\n\n\"Watchlist token\" is {{msg-mw|Prefs-watchlist-token}}",
	"apihelp-query+listmembership-description": "\"List\" here means the specific way, provided by the Gather extension, to store a list of wiki page titles in the wiki database.\n----\n{{doc-apihelp-description|lsm|listmembership|query+listmembership}}",
	"apihelp-query+listmembership-example-1": "{{doc-apihelp-example|lsm|listmembership|query+listmembership}}",
	"gather-view-collection": "Label for button that takes you to a collection.",
	"apihelp-query+listpages-paramvalue-dir-ascending": "{{Identical|Normal}}",
	"apihelp-query+listpages-paramvalue-dir-descending": "{{Identical|Reversed}}"
}
