{
	"@metadata": {
		"authors": [
			"Dan Garry",
			"Joaquin Hernandez",
			"Jon Robson",
			"Rob Moen",
			"Liuxinyu970226",
			"Robby",
			"Amire80",
			"Yuri Astrakhan",
			"Yurik",
			"Florian Schmidt"
		]
	},
	"gather": "Title of special page shown on Special:SpecialPages for viewing your own lists.",
	"gatherlists": "Title of special page shown on Special:SpecialPages that allows you to view all publicly created lists.",
	"gather-lists-showhidden": "Link title to show hidden lists on [[Special:GatherLists]].",
	"gather-lists-showvisible": "Link title to show visible lists on [[Special:GatherLists]].",
	"gather-lists-collection-owner": "Table column header in a list of all collections. The column will list usernames of people who own collection.\n{{Identical|Owner}}",
	"gather-lists-collection-last-updated": "Label for last updated time of a collection\n{{Identical|Last updated}}",
	"gather-lists-collection-title": "Label for title of collection on list of all collections\n{{Identical|Title}}",
	"gather-lists-collection-description": "Label for description of collection on list of all collections\n{{Identical|Description}}",
	"gather-lists-collection-count": "Label for count of collection on list of all collections\n{{Identical|Count}}",
	"gather-lists-hide-collection-label": "Label for button that performs moderation hide action which sets list from public to hidden.\n{{Identical|Hide}}",
	"gather-lists-hide-collection": "Label asking for confirmation when hiding a user's collection for moderation purposes. Parameters:\n* $1 - Title of the collection.\n* $2 - User name of the owner.",
	"gather-lists-hide-success-toast": "Label for toast displaying that specified list was hidden successfully. Parameters:\n* $1 - Title of the collection.",
	"gather-lists-hide-failure-toast": "Label for toast diaplaying that hiding specified list failed. Parameters:\n* $1 - Title of the collection.",
	"gather-lists-show-collection-label": "Label for button that performs moderation reveal/show action which resets list from hidden to public.\n{{Identical|Reveal}}",
	"gather-lists-show-collection": "Label asking for confirmation when revealing a user's collection for moderation purposes. Parameters:\n* $1 - Title of the collection.\n* $2 - User name of the owner.",
	"gather-lists-show-success-toast": "Label for toast displaying that specified list was shown successfully. Only shown to admins. Parameters:\n* $1 - Title of the collection.",
	"gather-lists-show-failure-toast": "Label for toast diaplaying that showing specified list failed. Only shown to admins. Parameters:\n* $1 - Title of the collection.",
	"gather-editfeed-show": "Label for button that toggles list on feed of edits.",
	"gather-editfeed-title": "Title for page that allows you to view edits inside a collection.",
	"gather-editfeed-empty": "Message that shows when no edits have been made recently to any pages inside a collection.",
	"gather-remove-from-collection-failed-toast": "Error message displayed to user when remove from collection action fails.",
	"gather-add-to-collection-failed-toast": "Error message displayed to user when add to collection action fails",
	"gather-edit-collection-heading": "Heading for collection editor overlay",
	"gather-edit-collection-label-name": "Label above input field for name of collection\n{{Identical|Name}}",
	"gather-edit-collection-label-description": "Label above input field for description of collection\n{{Identical|Description}}",
	"gather-edit-collection-label-privacy": "Label next to checkbox for making collection private.",
	"gather-edit-collection-save-label": "Label for save button in collection editor.\n{{Identical|Done}}",
	"gather-edit-collection-failed-error": "There was a problem saving the changes.",
	"gather-delete-collection-confirm": "Text under the heading asking the user if they would like to delete a collection.",
	"gather-delete-collection-heading": "Heading for collection delete overlay",
	"gather-delete-collection-delete-label": "Label for delete button in delete overlay.\n{{Identical|Delete}}",
	"gather-delete-collection-cancel-label": "Label for cancel button in delete overlay.\n{{Identical|Cancel}}",
	"gather-delete-collection-success": "Toast message indicating that deletion was successful.",
	"gather-delete-collection-failed-error": "Toast error indicating there was a problem deleting the collection.",
	"gather-error-unknown-collection": "Error message test when you try to edit a collection you do not own or that does not exist.",
	"gather-collection-member": "Alternative text displayed next to collection name when page is a member.",
	"gather-collection-non-member": "Alternative text displayed next to collection name when page is not a member.",
	"gather-anon-cta": "Message that shows to anonymous users when they click the add to collection button.",
	"gather-create-new-button-label": "Label for a button that is used to create a new collection.\n{{Identical|Create}}",
	"gather-add-new-placeholder": "Placeholder text for input field for new collection.",
	"gather-add-to-new": "Heading that shows in the watchstar content overlay above a form to create a new public collection.",
	"gather-add-to-existing": "Heading that shows in the watchstar content overlay above a list of your existing collections.",
	"gather-add-toast": "Message displayed when you add an item to a collection. Parameters:\n* $1 - Name of collection.",
	"gather-new-collection-failed-toast": "Message displayed when creating a new collection fails. Parameters:\n* $1 - Name of collection.",
	"gather-add-failed-toast": "Message displayed when adding an item to a collection fails. Parameters:\n* $1 - Name of collection.",
	"gather-add-title-invalid-toast": "Message displayed to a user when editing or creating a collection fails because of an invalid title.",
	"gather-add-to-collection-summary": "Text for a tutorial overlay presented to a user the first time they see the collections watchstar asking them if they would like to add the current page to a collection.\n\nParameters:\n* $1 - page title",
	"gather-add-to-collection-confirm": "Label for button that user can click if they would like to add the current page to a collection",
	"gather-add-to-collection-cancel": "Label for button that user can click if they do not want to add to a collection.\n{{Identical|No thanks}}",
	"gather-remove-toast": "Message displayed when you remove an item from a collection. Parameters:\n* $1 - Name of collection.",
	"gather-no-such-action": "Message used, if thse user tried to request a non-existent action on a collection.",
	"gather-unknown-error": "Used as an error message, if there was an unknown error.",
	"gather-desc": "{{desc|name=Gather|url=https://www.mediawiki.org/wiki/Extension:Gather}}",
	"gather-loginpage-desc": "User friendly description of Gather on mobile [[Special:UserLogin]] page.",
	"gather-no-public-lists-title": "The title of the view shown when there are no public collections for a user.",
	"gather-no-public-lists-description": "The descriptive text explaining that there are no public collections for a user.",
	"gather-page-not-found": "Text in place of the collection excerpt explaining that the page does not exist",
	"gather-anon-view-lists": "Text shown when trying to see your own collections on [[Special:Gather]] but the user is not logged in.",
	"gather-watchlist-title": "Title used for special casing the Watchlist collection on the [[Special:Gather]] page.\n{{Identical|Watchlist}}",
	"gather-watchlist-description": "Default description for special casing the Watchlist collection on the [[Special:Gather]] page.",
	"gather-lists-title": "Title for [[Special:Gather]] when displaying user curated lists.\n{{Identical|Collection}}",
	"gather-lists-from-user-title": "Title for [[Special:Gather]] when displaying user curated lists for a known user.\nParameters: $1 - name of user who collections belong to.",
	"gather-read-more": "Label for the read more link used on [[Special:Gather]].\n{{Identical|Read more}}",
	"gather-private": "Label for a collection when it is not publicly visible\n{{Identical|Private}}",
	"gather-public": "Label for a collection when it is publicly visible\n{{Identical|Public}}",
	"gather-article-count": "Expression of the number of pages in a collection. Parameter:\n* $1 - number of pages in the collection\n{{Identical|Page}}",
	"gather-empty": "Message shown on an empty rendered collection on [[Special:Gather]].",
	"gather-empty-footer": "Footnote shown on an empty collection on [[Special:Gather]] which instructs to the user how to add articles to a collection on their wiki. \nParameters: $1 - Name of site",
	"gather-edit-button": "Label for a button that enables editing a collection.\n{{Identical|Edit}}",
	"gather-delete-button": "Label for a button that enables deleting a collection.\n{{Identical|Delete}}",
	"right-gather-hidelist": "With gather, users can create lists and make them public. This right gives admins a way to hide or restore a list that violates WP policy.\n\n{{Doc-right|gather-hidelist}}",
	"apihelp-gather-description": "{{doc-apihelp-description|gather}}",
	"apihelp-gather-param-gather": "{{doc-apihelp-param|gather|gather}}",
	"apihelp-gather-param-owner": "{{doc-apihelp-param|gather|owner}}",
	"apihelp-gather-example-1": "{{doc-apihelp-example|gather}}",
	"gather-lists-collection-more-link-label": "Link label for a more type link on the Special:GatherLists page.",
	"gather-lists-more": "Link label for more link at the bottom of a list of users existing collections.",
	"gather-collection-more": "Label for link at bottom of Gather collection when there are more than 50 items.",
	"gather-add-to-another": "Label for button at bottom of collection overlay for when you have more collections that you could potentially add to.",
	"gather-watchstar-button-label": "A label for the button to add to a collection."
}
